benchmarks/apis/fastapi/random.log
          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: benchmark.js
     output: apis/fastapi/random.log

  scenarios: (100.00%) 1 scenario, 30 max VUs, 2m30s max duration (incl. graceful stop):
           * default: 30 looping VUs for 2m0s (gracefulStop: 30s)


running (2m00.0s), 00/30 VUs, 145510 complete and 0 interrupted iterations
default ✓ [======================================] 30 VUs  2m0s

     data_received..................: 28 MB  230 kB/s
     data_sent......................: 13 MB  104 kB/s
     http_req_blocked...............: min=704ns    max=692.36µs avg=1.61µs  med=1.42µs  p(95)=2.35µs   p(99)=3.52µs  
     http_req_connecting............: min=0s       max=249.2µs  avg=17ns    med=0s      p(95)=0s       p(99)=0s      
     http_req_duration..............: min=864.31µs max=97.9ms   avg=24.69ms med=23.27ms p(95)=38.53ms  p(99)=47.57ms 
       { expected_response:true }...: min=864.31µs max=97.9ms   avg=24.69ms med=23.27ms p(95)=38.53ms  p(99)=47.57ms 
     http_req_failed................: 0.00%  ✓ 0          ✗ 145510
     http_req_receiving.............: min=9.48µs   max=8.01ms   avg=78.21µs med=54.34µs p(95)=174.96µs p(99)=325.37µs
     http_req_sending...............: min=3.65µs   max=14.8ms   avg=7.18µs  med=6.42µs  p(95)=10.21µs  p(99)=13.14µs 
     http_req_tls_handshaking.......: min=0s       max=0s       avg=0s      med=0s      p(95)=0s       p(99)=0s      
     http_req_waiting...............: min=821.97µs max=97.83ms  avg=24.6ms  med=23.18ms p(95)=38.44ms  p(99)=47.46ms 
     http_reqs......................: 145510 1212.41723/s
     iteration_duration.............: min=907.29µs max=97.95ms  avg=24.73ms med=23.31ms p(95)=38.57ms  p(99)=47.64ms 
     iterations.....................: 145510 1212.41723/s
     vus............................: 30     min=30       max=30  
     vus_max........................: 30     min=30       max=30